# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO26 跨模态领域自适应 (Domain Adaptation) 定制版架构
# 基于YOLO26架构，集成DANN域对抗训练模块
# Model docs: https://docs.ultralytics.com/models/yolo26

# 类别数 (会自动被 dataset.yaml 中的 nc 覆盖)
nc: 80

# 是否使用端到端检测
end2end: True

# DFL bins
reg_max: 1

# 模型复合缩放系数 (深度, 宽度, 最大通道数)
scales:
  n: [0.50, 0.25, 1024]  # summary: 329 layers, 2,662,400 parameters, 9.5 GFLOPs
  s: [0.50, 0.50, 1024]  # summary: 329 layers, 9,765,856 parameters, 27.8 GFLOPs
  m: [0.50, 1.00, 512]   # summary: 349 layers, 21,144,288 parameters, 91.4 GFLOPs
  l: [1.00, 1.00, 512]   # summary: 489 layers, 25,815,520 parameters, 115.3 GFLOPs
  x: [1.00, 1.50, 512]   # summary: 489 layers, 57,935,232 parameters, 256.9 GFLOPs

# ====================================
# 1. 骨干网络 (Backbone)
# ====================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]  # 9
  - [-1, 2, C2PSA, [1024]]         # 10 (P5 最终特征输出)

# ====================================
# 2. 颈部与检测头 (Neck & Head)
# ====================================
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # 12 cat backbone P4
  - [-1, 2, C3k2, [512, True]]     # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # 15 cat backbone P3
  - [-1, 2, C3k2, [256, True]]     # 16 (P3/8-small 分支)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # 18 cat head P4
  - [-1, 2, C3k2, [512, True]]     # 19 (P4/16-medium 分支)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]     # 21 cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]  # 22 (P5/32-large 分支)

  # ====================================
  # 3. 域判别器与检测头
  # ====================================
  - [10, 1, DomainClassifier, [256]]   # 23 DANN 域判别器（P5 特征）
  - [[16, 19, 22], 1, Detect, [nc]]    # 24 Detect(P3, P4, P5)
